{
  "_class_name": "StableDiffusionXLPipeline",
  "vae": ["diffusers", "AutoencoderKL"],
  "_diffusers_version": "0.30.0",
  "text_encoder_2": ["transformers", "CLIPTextModelWithProjection"],
  "tokenizer_2": ["transformers", "CLIPTokenizer"],
  "tokenizer": ["transformers", "CLIPTokenizer"],
  "unet": ["diffusers", "UNet2DConditionModel"],
  "text_encoder": ["transformers", "CLIPTextModel"],
  "scheduler": ["diffusers", "DPMSolverMultistepScheduler"]
}
