{
  "id": "7607229834276559175",
  "title": "NVIDIA and Hyundai Motor Group Team on AI Factory to Power AI-Driven Mobility Solutions",
  "url": "https://nvidianews.nvidia.com/news/hyundai-motor-group-ai-factory",
  "published_date": "2025-10-31T06:00:00Z",
  "author": null,
  "summary": null,
  "source_type": "rss",
  "content_html": "APEC SummitNVIDIA today announced it is deepening its collaboration with Hyundai Motor Group to accelerate innovation in autonomous vehicles (AVs), smart factories and robotics with a new NVIDIA Blackwell-powered AI factory. Building on their strategic collaboration, Hyundai Motor Group and NVIDIA are now entering a new phase of collaboration, shifting from strategic adoption of advanced software platforms and infrastructure to joint innovation of core physical AI technologies. Together, they will codevelop AI capabilities for mobility solutions, a next-generation smart factory and on-device semiconductor advancements to strengthen Hyundai Motor Groups future capabilities. As part of this endeavor, Hyundai Motor Group and NVIDIA aim to enable integrated AI model training, validation and deployment using 50,000 NVIDIA Blackwell GPUs. In addition, in support of the Korean governments initiative to build a national physical AI cluster, Hyundai Motor Group and NVIDIA will work closely with government stakeholders to accelerate ecosystem development. This will result in an approximately 3 billion investment to advance the physical AI landscape in Korea. Key efforts include the establishment of an NVIDIA AI Technology Center, Hyundai Motor Groups Physical AI Application Center and regional data centers. This will also foster dynamic exchanges with NVIDIAs engineers and technicians, helping cultivate Koreas next generation of physical AI talent. AI is revolutionizing every facet of every industry, and in transportation alone from vehicle design and manufacturing to robotics and autonomous driving NVIDIAs AI and computing platforms are transforming how the world moves, said Jensen Huang, founder and CEO of NVIDIA. Together with Hyundai Motor Group Koreas industrial powerhouse and one of the worlds top mobility solutions providers were building intelligent cars and factories that will shape the future of the multitrillion-dollar mobility industry. As we enter a new era of AI-powered mobility and smart factories, deepening our collaboration with NVIDIA marks a pivotal step forward, said Euisun Chung, executive chair of Hyundai Motor Group. Together, we are not only building advanced technologies but also laying the foundation for a robust AI ecosystem in Korea one that fosters innovation, nurtures talent and positions us at the forefront of global AI leadership. \"For Korea to leap forward as a leading nation in AI, the advancement of physical AI is essential a key initiative championed by the Ministry of Science and ICT. This inaugural step in public-private collaboration to foster physical AI is therefore incredibly significant, said Bae Kyung-hoon, Deputy Prime Minister, and Minister of Science and ICT of the Republic of Korea. Korea has a strong foundation in manufacturing. By combining Koreas rich manufacturing data with NVIDIAs cutting-edge AI infrastructure, we expect to build a win-win model through collaboration with domestic companies, thereby accelerating innovative AI transformation in manufacturing across industries. Hyundai Motor Group Advances Automotive With NVIDIA AI Factory With its NVIDIA Blackwell-based AI factory, Hyundai Motor Group will deploy essential infrastructure for powering every phase of innovation bringing together in-vehicle AI, autonomous driving, factory automation and robotics into one intelligent, interconnected ecosystem. NVIDIA offers the three AI compute platforms that serve as the infrastructure for physical AI and robotics: Together, these computing platforms form the backbone of AI and car factories, enabling the transportation industry to develop, validate and deploy advanced physical AI at scale. Building Smart Factories and Safe Cars of the Future As part of the expanded collaboration, unveiled earlier this year, Hyundai Motor Group will use the NVIDIA Omniverse Enterprise platform to create robust factory digital twins virtual replicas of manufacturing environments that unify and manage factory data as well as enable precision control, software- and hardware-in-the-loop validation, discrete event simulation and virtual commissioning. These physically accurate digital environments accelerate robot integration, optimize production, enable predictive maintenance and pave the way for fully autonomous, software-defined factories reshaping how vehicles are designed and manufactured. NVIDIA Omniverse Enterprise also extends to humanoid and robotic systems using NVIDIA Issac Sim, an open robotics reference framework built on NVIDIA Omniverse. This enables virtual validation of task assignments, motion planning and ergonomic safety before robot deployment on physical production lines, significantly accelerating robot integration and maximizing productivity. Hyundai Motor Group is also testing the use of the NVIDIA Omniverse and Cosmos platforms on NVIDIA RTX PRO Servers, with NVIDIA RTX PRO 6000 Blackwell Server Edition GPUs, to build digital twins of regional driving environments and conditions, incorporating extensive simulations to advance its development pipeline. These sophisticated capabilities place Hyundai Motor Group at the forefront of scalable, next-generation autonomous driving. Hyundai Motor Group is developing advanced AI models built with the NVIDIA Nemotron open AI reasoning models and NVIDIA NeMo software to enable overtheair updates of capabilities and features across vehicles. In addition to autonomy capabilities, Hyundai Motor Group will use these advanced models to develop a range of innovative invehicle AI features, from personalized digital assistants to intelligent infotainment and adaptive comfort systems. This transforms vehicles into continuously learning, evolving intelligent agents. Inside Hyundai Motor Group vehicles, NVIDIA DRIVE AGX Thor, accelerated compute running on safety-certified NVIDIA DriveOS operating system, is set to provide the AI compute power for advanced driver-assistance and next-generation safety features, as well as immersive in-vehicle AI experiences. With NVIDIA, Hyundai Motor Group is evolving its vehicles and factories from independent systems into a single, interconnected and intelligent ecosystem, setting a new standard for the future of the global automotive industry. About NVIDIA NVIDIA(NASDAQ: NVDA) is the world leader in AI and accelerated computing. Certain statements in this press release including, but not limited to, statements as to: AI revolutionizing every facet of every industry. In transportation alone from vehicle design and manufacturing to robotics and autonomous driving NVIDIAs AI and computing platforms are transforming how the world moves; together with Hyundai Motor Group Koreas industrial powerhouse and one of the worlds top mobility solutions providers NVIDIA building intelligent cars and factories that will shape the future of themultitrillion-dollarmobility industry; the benefits, impact, performance, and availability of NVIDIAs products, services, and technologies; expectations with respect to NVIDIAs third party arrangements, including with its collaborators and partners; expectations with respect to technology developments; and other statements that are not historical facts are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which are subject to the safe harbor created by those sections based on managements beliefs and assumptions and on information currently available to management and are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic and political conditions; NVIDIAs reliance on third parties to manufacture, assemble, package and test NVIDIAs products; the impact of technological development and competition; development of new products and technologies or enhancements to NVIDIAs existing product and technologies; market acceptance of NVIDIAs products or NVIDIAs partners products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of NVIDIAs products or technologies when integrated into systems; and changes in applicable laws and regulations, as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the companys website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. Many of the products and features described herein remain in various stages and will be offered on a when-and-if-available basis. The statements above are not intended to be, and should not be interpreted as a commitment, promise, or legal obligation, and the development, release, and timing of any features or functionalities described for our products is subject to change and remains at the sole discretion of NVIDIA. NVIDIA will have no liability for failure to deliver or delay in the delivery of any of the products, features or functions set forth herein. 2025 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, NVIDIA Cosmos, NVIDIADGX, NVIDIA DRIVE AGX Thor, NVIDIADriveOS, NVIDIA Isaac Sim, NVIDIA NeMo, NVIDIANemotron, and NVIDIA Omniverse are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice.",
  "content_text": "APEC SummitNVIDIA today announced it is deepening its collaboration with Hyundai Motor Group to accelerate innovation in autonomous vehicles (AVs), smart factories and robotics with a new NVIDIA Blackwell-powered AI factory. Building on their strategic collaboration, Hyundai Motor Group and NVIDIA are now entering a new phase of collaboration, shifting from strategic adoption of advanced software platforms and infrastructure to joint innovation of core physical AI technologies. Together, they will codevelop AI capabilities for mobility solutions, a next-generation smart factory and on-device semiconductor advancements to strengthen Hyundai Motor Groups future capabilities. As part of this endeavor, Hyundai Motor Group and NVIDIA aim to enable integrated AI model training, validation and deployment using 50,000 NVIDIA Blackwell GPUs. In addition, in support of the Korean governments initiative to build a national physical AI cluster, Hyundai Motor Group and NVIDIA will work closely with government stakeholders to accelerate ecosystem development. This will result in an approximately 3 billion investment to advance the physical AI landscape in Korea. Key efforts include the establishment of an NVIDIA AI Technology Center, Hyundai Motor Groups Physical AI Application Center and regional data centers. This will also foster dynamic exchanges with NVIDIAs engineers and technicians, helping cultivate Koreas next generation of physical AI talent. AI is revolutionizing every facet of every industry, and in transportation alone from vehicle design and manufacturing to robotics and autonomous driving NVIDIAs AI and computing platforms are transforming how the world moves, said Jensen Huang, founder and CEO of NVIDIA. Together with Hyundai Motor Group Koreas industrial powerhouse and one of the worlds top mobility solutions providers were building intelligent cars and factories that will shape the future of the multitrillion-dollar mobility industry. As we enter a new era of AI-powered mobility and smart factories, deepening our collaboration with NVIDIA marks a pivotal step forward, said Euisun Chung, executive chair of Hyundai Motor Group. Together, we are not only building advanced technologies but also laying the foundation for a robust AI ecosystem in Korea one that fosters innovation, nurtures talent and positions us at the forefront of global AI leadership. \"For Korea to leap forward as a leading nation in AI, the advancement of physical AI is essential a key initiative championed by the Ministry of Science and ICT. This inaugural step in public-private collaboration to foster physical AI is therefore incredibly significant, said Bae Kyung-hoon, Deputy Prime Minister, and Minister of Science and ICT of the Republic of Korea. Korea has a strong foundation in manufacturing. By combining Koreas rich manufacturing data with NVIDIAs cutting-edge AI infrastructure, we expect to build a win-win model through collaboration with domestic companies, thereby accelerating innovative AI transformation in manufacturing across industries. Hyundai Motor Group Advances Automotive With NVIDIA AI Factory With its NVIDIA Blackwell-based AI factory, Hyundai Motor Group will deploy essential infrastructure for powering every phase of innovation bringing together in-vehicle AI, autonomous driving, factory automation and robotics into one intelligent, interconnected ecosystem. NVIDIA offers the three AI compute platforms that serve as the infrastructure for physical AI and robotics: Together, these computing platforms form the backbone of AI and car factories, enabling the transportation industry to develop, validate and deploy advanced physical AI at scale. Building Smart Factories and Safe Cars of the Future As part of the expanded collaboration, unveiled earlier this year, Hyundai Motor Group will use the NVIDIA Omniverse Enterprise platform to create robust factory digital twins virtual replicas of manufacturing environments that unify and manage factory data as well as enable precision control, software- and hardware-in-the-loop validation, discrete event simulation and virtual commissioning. These physically accurate digital environments accelerate robot integration, optimize production, enable predictive maintenance and pave the way for fully autonomous, software-defined factories reshaping how vehicles are designed and manufactured. NVIDIA Omniverse Enterprise also extends to humanoid and robotic systems using NVIDIA Issac Sim, an open robotics reference framework built on NVIDIA Omniverse. This enables virtual validation of task assignments, motion planning and ergonomic safety before robot deployment on physical production lines, significantly accelerating robot integration and maximizing productivity. Hyundai Motor Group is also testing the use of the NVIDIA Omniverse and Cosmos platforms on NVIDIA RTX PRO Servers, with NVIDIA RTX PRO 6000 Blackwell Server Edition GPUs, to build digital twins of regional driving environments and conditions, incorporating extensive simulations to advance its development pipeline. These sophisticated capabilities place Hyundai Motor Group at the forefront of scalable, next-generation autonomous driving. Hyundai Motor Group is developing advanced AI models built with the NVIDIA Nemotron open AI reasoning models and NVIDIA NeMo software to enable overtheair updates of capabilities and features across vehicles. In addition to autonomy capabilities, Hyundai Motor Group will use these advanced models to develop a range of innovative invehicle AI features, from personalized digital assistants to intelligent infotainment and adaptive comfort systems. This transforms vehicles into continuously learning, evolving intelligent agents. Inside Hyundai Motor Group vehicles, NVIDIA DRIVE AGX Thor, accelerated compute running on safety-certified NVIDIA DriveOS operating system, is set to provide the AI compute power for advanced driver-assistance and next-generation safety features, as well as immersive in-vehicle AI experiences. With NVIDIA, Hyundai Motor Group is evolving its vehicles and factories from independent systems into a single, interconnected and intelligent ecosystem, setting a new standard for the future of the global automotive industry. About NVIDIA NVIDIA(NASDAQ: NVDA) is the world leader in AI and accelerated computing. Certain statements in this press release including, but not limited to, statements as to: AI revolutionizing every facet of every industry. In transportation alone from vehicle design and manufacturing to robotics and autonomous driving NVIDIAs AI and computing platforms are transforming how the world moves; together with Hyundai Motor Group Koreas industrial powerhouse and one of the worlds top mobility solutions providers NVIDIA building intelligent cars and factories that will shape the future of themultitrillion-dollarmobility industry; the benefits, impact, performance, and availability of NVIDIAs products, services, and technologies; expectations with respect to NVIDIAs third party arrangements, including with its collaborators and partners; expectations with respect to technology developments; and other statements that are not historical facts are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which are subject to the safe harbor created by those sections based on managements beliefs and assumptions and on information currently available to management and are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic and political conditions; NVIDIAs reliance on third parties to manufacture, assemble, package and test NVIDIAs products; the impact of technological development and competition; development of new products and technologies or enhancements to NVIDIAs existing product and technologies; market acceptance of NVIDIAs products or NVIDIAs partners products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of NVIDIAs products or technologies when integrated into systems; and changes in applicable laws and regulations, as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the companys website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. Many of the products and features described herein remain in various stages and will be offered on a when-and-if-available basis. The statements above are not intended to be, and should not be interpreted as a commitment, promise, or legal obligation, and the development, release, and timing of any features or functionalities described for our products is subject to change and remains at the sole discretion of NVIDIA. NVIDIA will have no liability for failure to deliver or delay in the delivery of any of the products, features or functions set forth herein. 2025 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, NVIDIA Cosmos, NVIDIADGX, NVIDIA DRIVE AGX Thor, NVIDIADriveOS, NVIDIA Isaac Sim, NVIDIA NeMo, NVIDIANemotron, and NVIDIA Omniverse are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice."
}