{
  "id": "3256537691582253481",
  "title": "Five Key Takeaways from Dreamforce 2025",
  "url": "https://www.salesforce.com/news/stories/five-dreamforce-2025-takeaways/",
  "published_date": "2025-10-22T16:00:00Z",
  "author": null,
  "summary": null,
  "source_type": "rss",
  "content_html": "The transition to becoming an Agentic Enterprise where every company operates with boundless capacity, precision, and speed by pairing human expertise with AI-powered agents is not just an upgrade. It is a fundamental shift that can create entirely new capabilities, revenue streams, and ways of working. At Dreamforce 2025, attendees had the opportunity to explore what that looks like from a range of angles, whether they are CIOs at large organizations or founders and small business owners. To become truly Agentic Enterprises, Salesforce Chair and CEO Marc Benioff said on stage during his opening keynote, You have got to get your data right. You have got to get to more integrated solutions. You have got to get the priorities right. You have to get the governance right. He mentioned a recent MIT study that showed that generative AI pilot projects tend to fail. We all saw that just making our own models or rolling it ourselves, or DIYing it, isnt going to do it. We need to all be on this journey together to get to this better place that, in our vision, is the Agentic Enterprise. Heres what you need to know about getting started on that journey. We all saw that just making our own models or rolling it ourselves, or DIYing it, isnt going to do it. We need to all be on this journey together to get to this better place that, in our vision, is the Agentic Enterprise. One of the sessions was a series of roundtable discussions about building a successful Agentic Enterprise, and it kicked off with an honest dose of reality: everythings changing, nothing feels stable, and everyones boss suddenly wants all the AI. The message? Identify a single small use case, refine it, and build your Agentic Enterprise from there. The presenters and audience alike wrestled with the tension between ambition and readiness: AI is moving fast, but adoption requires grounding in solid data, thoughtful design, and a deep understanding of how people actually do their jobs. Success depends on getting the right information to the right agent human or digital at the right time. AI is moving fast, but adoption requires grounding in solid data, thoughtful design, and a deep understanding of how people actually do their jobs. To do that, data, data, data is key, and in another session, Salesforce on Salesforce: 5 Agentic Lessons, executives shared a tidy framework based on Salesforces experience as customer zero for other companies as they seek to become Agentic Enterprises: When the roundtable discussion turned to business priorities, the common driver was clear: do more with fewer people. Teams are stretched thin, yet expectations for customer experience remain sky-high. The promise of AI, many noted, lies not in replacement but in elevation helping humans work smarter and deliver more. A case study from RBC Wealth Management, presented by Greg Beltzer, Chief Customer Officer for AI, Agentforce at Salesforce, drove the point home. RBCs journey began with wealth advisors using AI to surface insights and save time during the meeting prep process. Because RBC had long treated data as a strategic asset, it was able to activate AI quickly and see tangible results: data completion rates soared, notes became richer, and adoption happened naturally no incentives required. The session closed on a human-centered note with William Dressler, Salesforce Global Head of AI Innovation, AI Practice, reframing AI architecture not as a tech stack, but as a blend of people, process, and trust. Building an Agentic Enterprise, he said, is as much about designing human-AI collaboration as it is about engineering systems. Without trust especially in the data AI cant take root. But with it, organizations can unlock something far more powerful than automation: alignment between human intelligence and machine capability. The Agentic Enterprise requires a fundamental architectural shift, moving from the traditional seven-layer IT model to an 11-layer architecture designed specifically to support AI agents. This transformation is necessary to allow AI agents to be able to sense, reason, and act with increasing autonomy. The four new layers are: the Semantic Layer, which provides unified data understanding and context for agents to reason effectively; the AI/ML Layer, which acts as a centralized intelligence hub for training and managing internal and external models; the Agentic Layer, which is the operational core providing frameworks and runtimes for building and executing agents at scale; and the Enterprise Orchestration Layer, which serves as the control plane for coordinating, governing, and optimizing workflows that span agents, humans, and deterministic systems. To manage this shift, enterprises should adopt a phased approach that delivers tangible business value at each step, moving from basic information retrieval to full multi-agent, cross-domain orchestration. This journey begins with Phase 1: Information Retrieval Agents, focused on building a trustworthy data foundation and the basic AI components needed for information retrieval through the agentic, AI/ML, and semantic layers. Once trust is established, move on to Phase 2: Domain-Specific Agent Workflows, where agents shift to action-oriented tasks within a specific area. The final stages are Phase 3: Cross-Domain Orchestration, automating complex processes that span organizational silos, and Phase 4: Multi-Agent, Multi-Domain Orchestration, which creates a holistic digital simulation of the enterprise for continuous improvement and strategic planning. These changes are more than a technical upgrade; theyre part of a strategic journey that helps enterprises truly harness the power of autonomous agents. In the last 26 years, more than 20 million potential customers contacted Salesforce and Salesforce didnt call them back. We didnt have enough people, said Benioff during his keynote. It fueled our competitors. Now, the Salesforce SDR agent handles 50,000 customers a week. It can do that because its deeply integrated with the Sales Cloud and Agentforce 360 Sales, he told the audience. If companies are going to use AI to operate with this kind of intelligence and speed, their tools need to have that kind of integration with each other and across the enterprise. That, he said, is what Agentforce 360 is. Introduced during Benioffs opening keynote, Agentforce 360 is the fourth edition of Agentforce, and now its the platform that powers everything Salesforce does, bringing together the four ingredients of an Agentic Enterprise: Agentforce 360 connects employees, operations, customers, and agents, all powered by trusted enterprise data (Data 360, at the center of the plate on the graphic below). The key is context. You dont have your data, then you dont have your context, you need that deep data integration, said Benioff. The interface for the platform is Slack the surface through which users can access an entire businesss intelligence, data, and processes in natural language in the flow of work. We do 11 trillion emails a year in Salesforce, but each of those emails, its a one-way conversation, continued Benioff. What if they were all two-way conversations? That is a vision for what it would look like when I use Slack. Today, Ive got dozens of agents that are helping me to make my Slack environment better, more efficient, renew my customers, and sell more effectively. Slack has become an agentic OS. Later, in a conversation with reporters, Athina Kanioura, EVP, Chief Strategy and Transformation Officer at PepsiCo, shared the ROI that PepsiCo is already seeing with Agentforce 360: We generated 25 to 30 efficiency. We have already rolled out Agentforce in more than 1.5 million stores globally. Our target is 5 million stores by the end of 2026. In one session with DeepLearning.AI founder Andrew Ng, an audience member asked a question about data: How would you recommend getting started organizing your data and building that data layer so that you can start moving toward agentic AI?Ng made the point that perfect should not be the enemy of good, saying One secret is, no matter what company you are, including the best, most respected AI companies, everyone feels like, Boy, my data is such a mess. Its so dirty. Im never done cleaning it. Instead of preemptively cleaning data or over-investing in architectures just get started on the application and then let that pull your data architecture forward. It is actually useful to put in place principles of governance: the security, the accessibility, deciding what to store, what to index. But then I find that the actual work of deciding which pieces of data to clean, I tend to not preemptively work on that ahead of the application. For every business thats out there, theres a finite amount of capital and a finite amount of resources, said Camping World CEO Marcus Lemonis at a session geared to SMBs and startups. You need to augment that with a lot of technology thats going to make it bigger. The catch? It has to be technology people can understand tools that empower employees, not replace them. Thats where small and midsize businesses have an edge. Smaller teams can adopt new technology quickly, without the analysis paralysis that bogs down larger organizations. The secret sauce to having such robust implementations is that we can move at a pace that is quite unique, said one participant. In an interview with the Salesforce team, Daniel Peter, CTO at Petaluma Creamery, echoed the sentiment that AI can help smaller teams deliver outsized results. I think theres a lot of potential for small businesses to reinvent themselves with AI, to be able to be competitive, to be able to get their margins up because theyre able to do way more with a small, lean team. Yes, historically, Salesforce has been built for large enterprises, but its worth paying a little more for something thats as reliable as what the big players have. Its actually pretty easy to scale it down.",
  "content_text": "The transition to becoming an Agentic Enterprise where every company operates with boundless capacity, precision, and speed by pairing human expertise with AI-powered agents is not just an upgrade. It is a fundamental shift that can create entirely new capabilities, revenue streams, and ways of working. At Dreamforce 2025, attendees had the opportunity to explore what that looks like from a range of angles, whether they are CIOs at large organizations or founders and small business owners. To become truly Agentic Enterprises, Salesforce Chair and CEO Marc Benioff said on stage during his opening keynote, You have got to get your data right. You have got to get to more integrated solutions. You have got to get the priorities right. You have to get the governance right. He mentioned a recent MIT study that showed that generative AI pilot projects tend to fail. We all saw that just making our own models or rolling it ourselves, or DIYing it, isnt going to do it. We need to all be on this journey together to get to this better place that, in our vision, is the Agentic Enterprise. Heres what you need to know about getting started on that journey. We all saw that just making our own models or rolling it ourselves, or DIYing it, isnt going to do it. We need to all be on this journey together to get to this better place that, in our vision, is the Agentic Enterprise. One of the sessions was a series of roundtable discussions about building a successful Agentic Enterprise, and it kicked off with an honest dose of reality: everythings changing, nothing feels stable, and everyones boss suddenly wants all the AI. The message? Identify a single small use case, refine it, and build your Agentic Enterprise from there. The presenters and audience alike wrestled with the tension between ambition and readiness: AI is moving fast, but adoption requires grounding in solid data, thoughtful design, and a deep understanding of how people actually do their jobs. Success depends on getting the right information to the right agent human or digital at the right time. AI is moving fast, but adoption requires grounding in solid data, thoughtful design, and a deep understanding of how people actually do their jobs. To do that, data, data, data is key, and in another session, Salesforce on Salesforce: 5 Agentic Lessons, executives shared a tidy framework based on Salesforces experience as customer zero for other companies as they seek to become Agentic Enterprises: When the roundtable discussion turned to business priorities, the common driver was clear: do more with fewer people. Teams are stretched thin, yet expectations for customer experience remain sky-high. The promise of AI, many noted, lies not in replacement but in elevation helping humans work smarter and deliver more. A case study from RBC Wealth Management, presented by Greg Beltzer, Chief Customer Officer for AI, Agentforce at Salesforce, drove the point home. RBCs journey began with wealth advisors using AI to surface insights and save time during the meeting prep process. Because RBC had long treated data as a strategic asset, it was able to activate AI quickly and see tangible results: data completion rates soared, notes became richer, and adoption happened naturally no incentives required. The session closed on a human-centered note with William Dressler, Salesforce Global Head of AI Innovation, AI Practice, reframing AI architecture not as a tech stack, but as a blend of people, process, and trust. Building an Agentic Enterprise, he said, is as much about designing human-AI collaboration as it is about engineering systems. Without trust especially in the data AI cant take root. But with it, organizations can unlock something far more powerful than automation: alignment between human intelligence and machine capability. The Agentic Enterprise requires a fundamental architectural shift, moving from the traditional seven-layer IT model to an 11-layer architecture designed specifically to support AI agents. This transformation is necessary to allow AI agents to be able to sense, reason, and act with increasing autonomy. The four new layers are: the Semantic Layer, which provides unified data understanding and context for agents to reason effectively; the AI/ML Layer, which acts as a centralized intelligence hub for training and managing internal and external models; the Agentic Layer, which is the operational core providing frameworks and runtimes for building and executing agents at scale; and the Enterprise Orchestration Layer, which serves as the control plane for coordinating, governing, and optimizing workflows that span agents, humans, and deterministic systems. To manage this shift, enterprises should adopt a phased approach that delivers tangible business value at each step, moving from basic information retrieval to full multi-agent, cross-domain orchestration. This journey begins with Phase 1: Information Retrieval Agents, focused on building a trustworthy data foundation and the basic AI components needed for information retrieval through the agentic, AI/ML, and semantic layers. Once trust is established, move on to Phase 2: Domain-Specific Agent Workflows, where agents shift to action-oriented tasks within a specific area. The final stages are Phase 3: Cross-Domain Orchestration, automating complex processes that span organizational silos, and Phase 4: Multi-Agent, Multi-Domain Orchestration, which creates a holistic digital simulation of the enterprise for continuous improvement and strategic planning. These changes are more than a technical upgrade; theyre part of a strategic journey that helps enterprises truly harness the power of autonomous agents. In the last 26 years, more than 20 million potential customers contacted Salesforce and Salesforce didnt call them back. We didnt have enough people, said Benioff during his keynote. It fueled our competitors. Now, the Salesforce SDR agent handles 50,000 customers a week. It can do that because its deeply integrated with the Sales Cloud and Agentforce 360 Sales, he told the audience. If companies are going to use AI to operate with this kind of intelligence and speed, their tools need to have that kind of integration with each other and across the enterprise. That, he said, is what Agentforce 360 is. Introduced during Benioffs opening keynote, Agentforce 360 is the fourth edition of Agentforce, and now its the platform that powers everything Salesforce does, bringing together the four ingredients of an Agentic Enterprise: Agentforce 360 connects employees, operations, customers, and agents, all powered by trusted enterprise data (Data 360, at the center of the plate on the graphic below). The key is context. You dont have your data, then you dont have your context, you need that deep data integration, said Benioff. The interface for the platform is Slack the surface through which users can access an entire businesss intelligence, data, and processes in natural language in the flow of work. We do 11 trillion emails a year in Salesforce, but each of those emails, its a one-way conversation, continued Benioff. What if they were all two-way conversations? That is a vision for what it would look like when I use Slack. Today, Ive got dozens of agents that are helping me to make my Slack environment better, more efficient, renew my customers, and sell more effectively. Slack has become an agentic OS. Later, in a conversation with reporters, Athina Kanioura, EVP, Chief Strategy and Transformation Officer at PepsiCo, shared the ROI that PepsiCo is already seeing with Agentforce 360: We generated 25 to 30 efficiency. We have already rolled out Agentforce in more than 1.5 million stores globally. Our target is 5 million stores by the end of 2026. In one session with DeepLearning.AI founder Andrew Ng, an audience member asked a question about data: How would you recommend getting started organizing your data and building that data layer so that you can start moving toward agentic AI?Ng made the point that perfect should not be the enemy of good, saying One secret is, no matter what company you are, including the best, most respected AI companies, everyone feels like, Boy, my data is such a mess. Its so dirty. Im never done cleaning it. Instead of preemptively cleaning data or over-investing in architectures just get started on the application and then let that pull your data architecture forward. It is actually useful to put in place principles of governance: the security, the accessibility, deciding what to store, what to index. But then I find that the actual work of deciding which pieces of data to clean, I tend to not preemptively work on that ahead of the application. For every business thats out there, theres a finite amount of capital and a finite amount of resources, said Camping World CEO Marcus Lemonis at a session geared to SMBs and startups. You need to augment that with a lot of technology thats going to make it bigger. The catch? It has to be technology people can understand tools that empower employees, not replace them. Thats where small and midsize businesses have an edge. Smaller teams can adopt new technology quickly, without the analysis paralysis that bogs down larger organizations. The secret sauce to having such robust implementations is that we can move at a pace that is quite unique, said one participant. In an interview with the Salesforce team, Daniel Peter, CTO at Petaluma Creamery, echoed the sentiment that AI can help smaller teams deliver outsized results. I think theres a lot of potential for small businesses to reinvent themselves with AI, to be able to be competitive, to be able to get their margins up because theyre able to do way more with a small, lean team. Yes, historically, Salesforce has been built for large enterprises, but its worth paying a little more for something thats as reliable as what the big players have. Its actually pretty easy to scale it down."
}