{
  "id": "6453861641720429448",
  "title": "NVIDIA, South Korea Government and Industrial Giants Build AI Infrastructure and Ecosystem to Fuel Korea Innovation, Industries and Jobs",
  "url": "https://nvidianews.nvidia.com/news/south-korea-ai-infrastructure",
  "published_date": "2025-10-31T06:00:00Z",
  "author": null,
  "summary": null,
  "source_type": "rss",
  "content_html": "APEC SummitNVIDIA today announced that it is working with South Korea to expand the nations AI infrastructure with over a quarter-million NVIDIA GPUs across its sovereign clouds and AI factories. Built with public- and private-sector deployments, the infrastructure forms the foundation for AI-enabled economic growth and innovation across Koreas industries, including automotive, manufacturing and telecommunications. Koreas leadership in technology and manufacturing positions it at the heart of the AI industrial revolution where accelerated computing infrastructure becomes as vital as power grids and broadband, said Jensen Huang, founder and CEO of NVIDIA. Just as Koreas physical factories have inspired the world with sophisticated ships, cars, chips and electronics, the nation can now produce intelligence as a new export that will drive global transformation. Now that AI has gone beyond mere innovation and become the foundation of future industries, South Korea stands at the threshold of transformation, said Bae Kyung-hoon, Korea Deputy Prime Minister, and Minister of Science and Information and Communication Technologies. Expanding our national AI infrastructure and developing technologies with NVIDIA is an investment that will further reinforce South Koreas strengths, including its manufacturing capabilities. This will support South Koreas prosperity as it strives to become one of the top three global AI powerhouses. Announced as world leaders gather in South Korea for the APEC Summit, the Ministry of Science and ICT (MSIT) is accelerating its plans to deploy up to 50,000 of the latest NVIDIA GPUs to accelerate sovereign AI development for enterprises and industries. The AI infrastructure deployment will grow over the next several years from an initial deployment of 13,000 NVIDIA Blackwell and other GPUs by NVIDIA Cloud Partner NAVER Cloud, together with NHN Cloud and Kakao Corp., to expand computing infrastructure on the nations sovereign clouds through initiatives such as the establishment of Koreas National AI Computing Center. Research institutes, startups and AI companies will be able to use the sovereign infrastructure to build models and applications, supporting Koreas national strategy to boost AI capabilities and infrastructure. In addition, NVIDIA is working with industries, academia and research institutions in Korea on AI-RAN and 6G infrastructure. NVIDIA is collaborating with Samsung, SK Telecom, ETRI, KT, LGU and Yonsei University to develop intelligent, low-power AI-RAN network technology that can reduce computing costs and extend device battery life by offloading GPU computation tasks to the networks base station. Koreas Industry Titans Build NVIDIA AI Factories for Advanced Manufacturing Automotive, manufacturing and telecommunications leaders in Korea are developing significant AI infrastructure investments and expansions to accelerate enterprise and physical AI development. Samsung is building a semiconductor AI factory with over 50,000 GPUs to advance intelligent manufacturing and bring AI to its products and services. It is using NVIDIA technologies, including NVIDIA Nemotron post-training datasets, NVIDIA CUDA-X, the NVIDIA cuLitho library and NVIDIA Omniverse, to build digital twins that improve the speed and yields of sophisticated semiconductor manufacturing processes. Samsung is also using NVIDIA Cosmos, NVIDIA Isaac Sim and NVIDIA Isaac Lab to advance its home robot development portfolio. SK Group is designing an AI factory that can host over 50,000 NVIDIA GPUs to advance semiconductor research, development and production, as well as cloud infrastructure to support digital twin and AI agent development. SK Telecom plans to provide sovereign infrastructure featuring NVIDIA RTX PRO 6000 Blackwell Server Edition GPUs, enabling domestic manufacturers to tap into NVIDIA Omniverse. The company will offer industrial cloud infrastructure to accelerate digital twin and robotics projects for startups, enterprises and government agencies. Hyundai Motor Group and NVIDIA are entering a new phase of deepened collaboration and will codevelop AI capabilities across mobility, smart factories and on-device semiconductors, powered by 50,000 Blackwell GPUs for AI model training and deployment. In support of the Korean governments initiative to build a national physical AI cluster, Hyundai Motor Group and NVIDIA will work closely with government stakeholders to accelerate ecosystem development. This will result in an approximately 3 billion investment to advance the physical AI landscape in Korea. Key initiatives include the creation of an NVIDIA AI Technology Center, Hyundai Motor Group Physical AI Application Center and regional AI data centers. NAVER Cloud is also expanding its NVIDIA AI infrastructure and plans to deploy over 60,000 GPUs including NVIDIA RTX PRO 6000 Blackwell and other NVIDIA Blackwell GPUs for sovereign and physical AI. NAVER Cloud is preparing for the next stage of sovereign AI development in Korea, powered by NVIDIA Nemotron open models running on its NVIDIA AI infrastructure. NAVER Cloud plans to develop industry-specific AI models like shipbuilding and security, with a focus on inclusive AI for Koreas citizens. Korea Government and Developers Advance LLM Research With NVIDIA Teaming with NVIDIA, Koreas MSIT is advancing its Sovereign AI Foundation Models project to develop sovereign language models. The project will incorporate NVIDIA NeMo and open NVIDIA Nemotron datasets to tap local data for developing and distilling reasoning models. LG AI Research, NAVER Cloud, NC AI, SK Telecom and Upstage are participating in the project to support sovereign model development. Enterprises, researchers and startups will be able to contribute to and use the models to create AI agents with speech, reasoning and other capabilities. LG is working with NVIDIA to foster physical AI technology development and support the physical AI ecosystem. NVIDIA and LG are also working together to support startups and academia with LGs EXAONE models including the EXAONE Path healthcare model, built with the MONAI framework to support cancer diagnosis. Korea and NVIDIA Advance Quantum Computing and Scientific Research The Korea Institute of Science and Technology Information (KISTI) is working with NVIDIA to establish a Center of Excellence designed to foster research collaboration using Korea's sixth-generation national supercomputer, HANGANG, which features NVIDIA accelerated computing. KISTI also announced support for the new NVIDIA NVQLink open architecture for connecting quantum processors and GPU supercomputing. Working with the NVIDIA CUDA-Q platform, NVQLink equips KISTI to deepen research in areas like quantum error correction and hybrid application development to accelerate the development of tomorrows quantum-GPU supercomputers. KISTI will also build foundation models for scientific research and development, and support researchers on developing physics-informed AI models using the open-source NVIDIA PhysicsNeMo framework. New Startup Alliance Supports Korean Development Furthering economic development and opportunities in Korea, NVIDIA and its partners are establishing an alliance to foster startups through the NVIDIA Inception program. Members will be able to access accelerated computing infrastructure from NVIDIA Cloud Partners including SK Telecom, with support from NVIDIA Inception and VC Alliance members including IMM Investment, Korea Investment Partners and SBVA. Startups will also have access to NVIDIA software and expertise, speeding growth for the next generation of companies. Building on its work through the NVIDIA Inception program for startups, NVIDIA also plans to work with the Korean government to support the next generation of companies. It will participate in the N-Up AI startup incubation program operated by the Korea Ministry of SMEs and Startups. About NVIDIA NVIDIA(NASDAQ: NVDA) is the world leader in AI and accelerated computing. Certain statements in this press release including, but not limited to, statements as to: just as Koreas physical factories have inspired the world with sophisticated ships, cars, chips and electronics, the nations AI factories now being able to produce intelligence as a new export that will drive global transformation; the benefits, impact, performance, and availability of NVIDIAs products, services, and technologies; expectations with respect to NVIDIAs third party arrangements, including with its collaborators and partners; expectations with respect to technology developments; and other statements that are not historical facts are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which are subject to the safe harbor created by those sections based on managements beliefs and assumptions and on information currently available to management and are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic and political conditions; NVIDIAs reliance on third parties to manufacture, assemble, package and test NVIDIAs products; the impact of technological development and competition; development of new products and technologies or enhancements to NVIDIAs existing product and technologies; market acceptance of NVIDIAs products or NVIDIAs partners products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of NVIDIAs products or technologies when integrated into systems; and changes in applicable laws and regulations, as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the companys website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. 2025 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, CUDA-Q, CUDA-X, NVIDIA Cosmos, NVIDIA Isaac Sim, NVIDIA NeMo, NVIDIANemotron, NVIDIAPhysicsNeMo,NVQLinkand NVIDIARTXPRO are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and/or other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability, and specifications are subject to change without notice.",
  "content_text": "APEC SummitNVIDIA today announced that it is working with South Korea to expand the nations AI infrastructure with over a quarter-million NVIDIA GPUs across its sovereign clouds and AI factories. Built with public- and private-sector deployments, the infrastructure forms the foundation for AI-enabled economic growth and innovation across Koreas industries, including automotive, manufacturing and telecommunications. Koreas leadership in technology and manufacturing positions it at the heart of the AI industrial revolution where accelerated computing infrastructure becomes as vital as power grids and broadband, said Jensen Huang, founder and CEO of NVIDIA. Just as Koreas physical factories have inspired the world with sophisticated ships, cars, chips and electronics, the nation can now produce intelligence as a new export that will drive global transformation. Now that AI has gone beyond mere innovation and become the foundation of future industries, South Korea stands at the threshold of transformation, said Bae Kyung-hoon, Korea Deputy Prime Minister, and Minister of Science and Information and Communication Technologies. Expanding our national AI infrastructure and developing technologies with NVIDIA is an investment that will further reinforce South Koreas strengths, including its manufacturing capabilities. This will support South Koreas prosperity as it strives to become one of the top three global AI powerhouses. Announced as world leaders gather in South Korea for the APEC Summit, the Ministry of Science and ICT (MSIT) is accelerating its plans to deploy up to 50,000 of the latest NVIDIA GPUs to accelerate sovereign AI development for enterprises and industries. The AI infrastructure deployment will grow over the next several years from an initial deployment of 13,000 NVIDIA Blackwell and other GPUs by NVIDIA Cloud Partner NAVER Cloud, together with NHN Cloud and Kakao Corp., to expand computing infrastructure on the nations sovereign clouds through initiatives such as the establishment of Koreas National AI Computing Center. Research institutes, startups and AI companies will be able to use the sovereign infrastructure to build models and applications, supporting Koreas national strategy to boost AI capabilities and infrastructure. In addition, NVIDIA is working with industries, academia and research institutions in Korea on AI-RAN and 6G infrastructure. NVIDIA is collaborating with Samsung, SK Telecom, ETRI, KT, LGU and Yonsei University to develop intelligent, low-power AI-RAN network technology that can reduce computing costs and extend device battery life by offloading GPU computation tasks to the networks base station. Koreas Industry Titans Build NVIDIA AI Factories for Advanced Manufacturing Automotive, manufacturing and telecommunications leaders in Korea are developing significant AI infrastructure investments and expansions to accelerate enterprise and physical AI development. Samsung is building a semiconductor AI factory with over 50,000 GPUs to advance intelligent manufacturing and bring AI to its products and services. It is using NVIDIA technologies, including NVIDIA Nemotron post-training datasets, NVIDIA CUDA-X, the NVIDIA cuLitho library and NVIDIA Omniverse, to build digital twins that improve the speed and yields of sophisticated semiconductor manufacturing processes. Samsung is also using NVIDIA Cosmos, NVIDIA Isaac Sim and NVIDIA Isaac Lab to advance its home robot development portfolio. SK Group is designing an AI factory that can host over 50,000 NVIDIA GPUs to advance semiconductor research, development and production, as well as cloud infrastructure to support digital twin and AI agent development. SK Telecom plans to provide sovereign infrastructure featuring NVIDIA RTX PRO 6000 Blackwell Server Edition GPUs, enabling domestic manufacturers to tap into NVIDIA Omniverse. The company will offer industrial cloud infrastructure to accelerate digital twin and robotics projects for startups, enterprises and government agencies. Hyundai Motor Group and NVIDIA are entering a new phase of deepened collaboration and will codevelop AI capabilities across mobility, smart factories and on-device semiconductors, powered by 50,000 Blackwell GPUs for AI model training and deployment. In support of the Korean governments initiative to build a national physical AI cluster, Hyundai Motor Group and NVIDIA will work closely with government stakeholders to accelerate ecosystem development. This will result in an approximately 3 billion investment to advance the physical AI landscape in Korea. Key initiatives include the creation of an NVIDIA AI Technology Center, Hyundai Motor Group Physical AI Application Center and regional AI data centers. NAVER Cloud is also expanding its NVIDIA AI infrastructure and plans to deploy over 60,000 GPUs including NVIDIA RTX PRO 6000 Blackwell and other NVIDIA Blackwell GPUs for sovereign and physical AI. NAVER Cloud is preparing for the next stage of sovereign AI development in Korea, powered by NVIDIA Nemotron open models running on its NVIDIA AI infrastructure. NAVER Cloud plans to develop industry-specific AI models like shipbuilding and security, with a focus on inclusive AI for Koreas citizens. Korea Government and Developers Advance LLM Research With NVIDIA Teaming with NVIDIA, Koreas MSIT is advancing its Sovereign AI Foundation Models project to develop sovereign language models. The project will incorporate NVIDIA NeMo and open NVIDIA Nemotron datasets to tap local data for developing and distilling reasoning models. LG AI Research, NAVER Cloud, NC AI, SK Telecom and Upstage are participating in the project to support sovereign model development. Enterprises, researchers and startups will be able to contribute to and use the models to create AI agents with speech, reasoning and other capabilities. LG is working with NVIDIA to foster physical AI technology development and support the physical AI ecosystem. NVIDIA and LG are also working together to support startups and academia with LGs EXAONE models including the EXAONE Path healthcare model, built with the MONAI framework to support cancer diagnosis. Korea and NVIDIA Advance Quantum Computing and Scientific Research The Korea Institute of Science and Technology Information (KISTI) is working with NVIDIA to establish a Center of Excellence designed to foster research collaboration using Korea's sixth-generation national supercomputer, HANGANG, which features NVIDIA accelerated computing. KISTI also announced support for the new NVIDIA NVQLink open architecture for connecting quantum processors and GPU supercomputing. Working with the NVIDIA CUDA-Q platform, NVQLink equips KISTI to deepen research in areas like quantum error correction and hybrid application development to accelerate the development of tomorrows quantum-GPU supercomputers. KISTI will also build foundation models for scientific research and development, and support researchers on developing physics-informed AI models using the open-source NVIDIA PhysicsNeMo framework. New Startup Alliance Supports Korean Development Furthering economic development and opportunities in Korea, NVIDIA and its partners are establishing an alliance to foster startups through the NVIDIA Inception program. Members will be able to access accelerated computing infrastructure from NVIDIA Cloud Partners including SK Telecom, with support from NVIDIA Inception and VC Alliance members including IMM Investment, Korea Investment Partners and SBVA. Startups will also have access to NVIDIA software and expertise, speeding growth for the next generation of companies. Building on its work through the NVIDIA Inception program for startups, NVIDIA also plans to work with the Korean government to support the next generation of companies. It will participate in the N-Up AI startup incubation program operated by the Korea Ministry of SMEs and Startups. About NVIDIA NVIDIA(NASDAQ: NVDA) is the world leader in AI and accelerated computing. Certain statements in this press release including, but not limited to, statements as to: just as Koreas physical factories have inspired the world with sophisticated ships, cars, chips and electronics, the nations AI factories now being able to produce intelligence as a new export that will drive global transformation; the benefits, impact, performance, and availability of NVIDIAs products, services, and technologies; expectations with respect to NVIDIAs third party arrangements, including with its collaborators and partners; expectations with respect to technology developments; and other statements that are not historical facts are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which are subject to the safe harbor created by those sections based on managements beliefs and assumptions and on information currently available to management and are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic and political conditions; NVIDIAs reliance on third parties to manufacture, assemble, package and test NVIDIAs products; the impact of technological development and competition; development of new products and technologies or enhancements to NVIDIAs existing product and technologies; market acceptance of NVIDIAs products or NVIDIAs partners products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of NVIDIAs products or technologies when integrated into systems; and changes in applicable laws and regulations, as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the companys website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. 2025 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, CUDA-Q, CUDA-X, NVIDIA Cosmos, NVIDIA Isaac Sim, NVIDIA NeMo, NVIDIANemotron, NVIDIAPhysicsNeMo,NVQLinkand NVIDIARTXPRO are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and/or other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability, and specifications are subject to change without notice."
}