{
  "id": "3177323422034198734",
  "title": "Announcing Pinecone Pioneers: A Program for Builders, Organizers, and Community Leaders",
  "url": "https://www.pinecone.io/blog/announcing-pinecone-pioneers-program/",
  "published_date": null,
  "author": null,
  "summary": "Get the latest updates via email when they're published: AI is evolving fastand so is the way people build and share what they know. Weve seen developers in the Pinecone community doing a lot more than ship code. Theyre writing tutorials, hosting meetups, helping others get unstuck, and creating content other developers refer to. We want to support that work. So weve launched the Pinecone Pioneers program. Pinecone Pioneers is our way of recognizing and supporting the people who push the boundar",
  "original_title": "Announcing Pinecone Pioneers: A Program for Builders, Organizers, and Community Leaders",
  "image_url": "https://www.pinecone.io/api/og/?title=Announcing%20Pinecone%20Pioneers:%20A%20Program%20for%20Builders,%20Organizers,%20and%20Community%20Leaders&category=Blog",
  "source_type": "html",
  "content_html": "Get the latest updates via email when they're published: AI is evolving fastand so is the way people build and share what they know. Weve seen developers in the Pinecone community doing a lot more than ship code. Theyre writing tutorials, hosting meetups, helping others get unstuck, and creating content other developers refer to. We want to support that work. So weve launched the Pinecone Pioneers program. Pinecone Pioneers is our way of recognizing and supporting the people who push the boundaries of making AI knowledgeable those working on agentic AI, search, personalized assistants, and everything in between. The goal is to elevate their work, open up opportunities for collaboration, and give back in meaningful ways. This first cohort includes people from all over the world, working across startups, research, and enterprise. Youll be seeing more of them soonin blog posts, on stage, and online. Over the next weeks, well be highlighting their work in: Were just getting started, and the program will continue to grow throughout 2025. This program recognizes people who are already out there doing the workbuilding with Pinecone, teaching others, sharing what theyve learned, and helping the broader AI ecosystem move forward. Its not a promotional campaign or a perk club. Its a simple way to back the people who are showing up and contributing meaningfully. Early product roadmap Be the first to know whats shipping and where were headed Amplification Well help more people see what youre doing Direct access to the team Feedback goes both ways Support for talks and events Well help you get there, whether thats a conference or a meetup Private space for Pioneers A quieter place to share ideas Were looking for people who are actively building and sharing. That could mean: You dont need a huge following. Just a clear point of view and a willingness to share. If that sounds like youor like someone you knowwed love to hear from you. Apply here Create your first index for free, then pay as you go when you're ready to scale.",
  "content_text": "Get the latest updates via email when they're published: AI is evolving fastand so is the way people build and share what they know. Weve seen developers in the Pinecone community doing a lot more than ship code. Theyre writing tutorials, hosting meetups, helping others get unstuck, and creating content other developers refer to. We want to support that work. So weve launched the Pinecone Pioneers program. Pinecone Pioneers is our way of recognizing and supporting the people who push the boundaries of making AI knowledgeable those working on agentic AI, search, personalized assistants, and everything in between. The goal is to elevate their work, open up opportunities for collaboration, and give back in meaningful ways. This first cohort includes people from all over the world, working across startups, research, and enterprise. Youll be seeing more of them soonin blog posts, on stage, and online. Over the next weeks, well be highlighting their work in: Were just getting started, and the program will continue to grow throughout 2025. This program recognizes people who are already out there doing the workbuilding with Pinecone, teaching others, sharing what theyve learned, and helping the broader AI ecosystem move forward. Its not a promotional campaign or a perk club. Its a simple way to back the people who are showing up and contributing meaningfully. Early product roadmap Be the first to know whats shipping and where were headed Amplification Well help more people see what youre doing Direct access to the team Feedback goes both ways Support for talks and events Well help you get there, whether thats a conference or a meetup Private space for Pioneers A quieter place to share ideas Were looking for people who are actively building and sharing. That could mean: You dont need a huge following. Just a clear point of view and a willingness to share. If that sounds like youor like someone you knowwed love to hear from you. Apply here Create your first index for free, then pay as you go when you're ready to scale."
}