{
  "id": "5499661746890607175",
  "title": "GPT-5.1: A smarter, more conversational ChatGPT",
  "url": "https://openai.com/index/gpt-5-1",
  "published_date": "2025-11-12T00:00:00Z",
  "author": null,
  "summary": null,
  "original_title": "GPT-5.1: A smarter, more conversational ChatGPT",
  "source_type": "rss",
  "content_html": "Were upgrading GPT5 while making it easier to customize ChatGPT. Starting to roll out today to everyone, beginning with paid users. Today were upgrading the GPT5 series with the release of: We heard clearly from users that great AI should not only be smart, but also enjoyable to talk to. GPT5.1 improves meaningfully on both intelligence and communication style. Were also making it easier for you to shape ChatGPTs tone. Preferences on chat style varyfrom person to person and even from conversation to conversationso were introducing more intuitive and effective controls so ChatGPT can better match the tone you want in responses. GPT5.1 Instant, ChatGPTs most used model, is now warmer by default and more conversational. Based on early testing, it often surprises people with its playfulness while remaining clear and useful. I'm feeling stressed and could use some relaxation tips Here are a few simple, effective ways to help ease stress you can mix and match depending on how youre feeling and how much time you have: If you tell me what kind of stress it is (work, parenting, financial, emotional, physical, etc.), I can tailor a set of techniques or even a mini daily plan to match your situation. Would you like me to do that? Ive got you, Ron thats totally normal, especially with everything youve got going on lately. Here are a few ways to decompress depending on what kind of stress youre feeling: Would you like me to tailor a short 5-minute routine you can do right now (either physical, mental, or creative your choice)? Weve also improved instruction following, so the model more reliably answers the question you actually asked. Its trending for summer 2025 destinations. Youll find a mix of culture, nature and modern city life. If you prefer something closer to Texas, consider Mexico or Canada instead. Want suggestions for specific cities in Japan (or elsewhere)? For the first time, GPT5.1 Instant can use adaptive reasoning to decide when to think before responding to more challenging questions, resulting in more thorough and accurate answers, while still responding quickly. This is reflected in significant improvements on math and coding evaluations like AIME 2025 and Codeforces. Were also upgrading GPT5 Thinking to make it more efficient and easier to understand in everyday use. It now adapts its thinking time more precisely to the questionspending more time on complex problems while responding more quickly to simpler ones. In practice, that means more thorough answers for difficult requests and less waiting for simpler ones. GPT5.1 Thinking varies its thinking time more dynamically than GPT5 Thinking. On a representative distribution of ChatGPT tasks, GPT5.1 Thinking is roughly twice as fast on the fastest tasks and twice as slow on the slowest tasks. Thinking time was set to Standard for both models. GPT5.1 Thinkings responses are also clearer, with less jargon and fewer undefined terms. This makes our most capable model more approachable and easily understandable, especially for complex tasks at work and explaining technical concepts. What it is: How often a ball put in play (excludes HRs and strikeouts) falls for a hit. BABIPHHRABKHRSF \\text{BABIP} \\frac{H - HR}{AB - K - HR SF} BABIPABKHRSFHHR What it is: The gold-standard, park- and era-adjusted measure of total offensive value per plate appearance. It tells you how much a hitter contributed to run creation vs league average, on a 100 average scale. Why its great: It compares hitters fairly across parks (Coors vs. Safeco) and seasons (offense-heavy vs dead-ball-ish years). It also captures more than batting averagewalks and extra-base hits count properly. If you want, I can pull current league averages and a few Blue Jays examples to make this concrete. Ill do each one in plain English, then add a bit of context. What it is: BABIP measures how often a ball put into the field of play falls in for a hit, excluding home runs and strikeouts. BABIP (Hits Home Runs) (At-Bats Strikeouts Home Runs Sacrifice Flies) What it is: wRC is a catch-all hitting stat that tells you how good a hitter is at creating runs compared to league average, adjusted for ballpark and era. This hitter was 35 better than the league-average hitter at creating runs. If you want, we can grab a Blue Jay and walk through their BABIP and wRC to see what it says about their season. GPT5.1 Thinkings default tone is also warmer and more empathetic. Ugh I spilled coffee all over myself before my meeting do you think everyone thought I was an idiot :( Oof, thats such a gut-punch feeling. Im really sorry that happened. Short answer: no, most people probably didnt think that. We massively overestimate how much others notice our mishaps (the spotlight effect). Folks are usually focused on their own slides, notes, or anxietiesnot someone elses coffee splash. Youre not an idiotyou were a human who had a spill and kept going. Thats competent, not clumsy. Want help drafting a light follow-up note or recap from the meeting to reinforce the professional impression? Hey no, they didnt. Youre rattled, so your brain is doing that thing where it catastrophizes a tiny mishap into a character flaw. But honestly? People barely register this stuff. Everyones sprinting between calls, half-distracted, juggling their own chaos. A coffee spill reads as busy human, not idiot. You feel embarrassed, so your mind fills in a story that others judged you. In truth, most people wont even remember it happened. Thats competence. Most folks would crumble a bit. You handled it. Small imperfections make people more relatable. A hyper-polished person feels artificial. A quick coffee mishap? Humanizing. And honestly they probably respected that you powered through. Youre not an idiot. Youre a person who had a chaotic moment, wiped it up, and still showed up. Thats the opposite of foolish thats resilience. This release is a step forward in both capability and usability across the models. GPT5.1 Auto will continue to route each query to the model best suited for it, so in most cases, you wont need to choose a model at all. What you will notice is that answers across GPT5.1 feel both smarter and more natural in tone. GPT5.1 Instant and Thinking begin rolling out today, starting with paid (Pro, Plus, Go, Business) users and then to free and logged-out users. Enterprise and Edu plans get a seven-day early-access toggle (off by default). After that window, GPT5.1 will become the sole default model. If you check ChatGPT today, you may not see GPT5.1 available immediately. We plan to roll it out gradually over the next few days to help keep performance stable for everyone. We will also update GPT5 Pro to GPT5.1 Pro soon. Were bringing both GPT5.1 Instant and GPT5.1 Thinking to the API later this week. GPT5.1 Instant will be added as gpt-5.1-chat-latest, and GPT5.1 Thinking will be released as GPT5.1 in the API, both with adaptive reasoning. GPT5 (Instant and Thinking) will remain available in ChatGPT under the legacy models dropdown for paid subscribers for three months, so people have time to compare and adapt at their own pace. The GPT5 sunset period does not affect the availability of other legacy models. Going forward, when we introduce new ChatGPT models, our approach is to give people ample space to evaluate whats changed and share feedback, allowing us to continue innovating our frontier models while transitioning smoothly. Sunset periods will be communicated clearly and with plenty of advance notice. GPT5.1 is more capable and useful, and we encourage you to try it and see the difference. Our system card addendum includes more information on our safety approach for GPT5.1. And a note on naming: this update is called GPT5.1 to reflect meaningful improvements, while remaining within the GPT5 generation. Future iterative upgrades to GPT5 will follow the same pattern. Alongside these model improvements, were making it easier to customize ChatGPTs tone and style. People have strong and varied preferences in how ChatGPT should respond, and tailoring its tone to what sounds right for you should feel effortless. Earlier this year, we added preset options to tailor the tone of how ChatGPT responds. Today, were refining those options to better reflect the most common ways people use ChatGPT. Default, Friendly (formerly Listener), and Efficient (formerly Robot) remain (with updates), and were adding Professional, Candid, and Quirky. These options are designed to align with what weve learned about how people naturally steer the model, making it quick and intuitive to choose a personality that feels uniquely right. These personality settings apply across all models. The original Cynical (formerly Cynic) and Nerdy (formerly Nerd) options we introduced earlier this year will remain available unchanged under the same dropdown in personalization settings. Beyond these presets, for users who want more granular control over how ChatGPT responds, were also experimenting with the ability to tune ChatGPTs characteristics directly from personalization settingsincluding how concise, warm, or scannable its responses are, and how frequently it uses emojis. ChatGPT can also proactively offer to update these preferences during conversations when it notices you asking for a certain tone or style, without requiring you to navigate into settings. You can adjust or remove any of these preferences at any time. The updated styles and tone options are rolling out today, and the ability to finetune specific characteristics is starting to roll out gradually later this week as an experiment, starting with a limited number of users. Both will continue to improve over time. Additionally, the updated GPT5.1 models are also better at adhering to custom instructions, giving you even more precise control over tone and behavior. Updates you make in personalization settings now take effect across all chats right away, including ongoing conversations, so your experience stays consistent. Before, changes to base style and tone or custom instructions only applied to conversations started afterward. Todays GPT5.1 updates and new customization options are a step toward a ChatGPT that feels like it fits yousmarter, more enjoyable to talk to, and more adaptable to your preferences. Going forward, well continue improving along these dimensionstheres much more to come.",
  "content_text": "Were upgrading GPT5 while making it easier to customize ChatGPT. Starting to roll out today to everyone, beginning with paid users. Today were upgrading the GPT5 series with the release of: We heard clearly from users that great AI should not only be smart, but also enjoyable to talk to. GPT5.1 improves meaningfully on both intelligence and communication style. Were also making it easier for you to shape ChatGPTs tone. Preferences on chat style varyfrom person to person and even from conversation to conversationso were introducing more intuitive and effective controls so ChatGPT can better match the tone you want in responses. GPT5.1 Instant, ChatGPTs most used model, is now warmer by default and more conversational. Based on early testing, it often surprises people with its playfulness while remaining clear and useful. I'm feeling stressed and could use some relaxation tips Here are a few simple, effective ways to help ease stress you can mix and match depending on how youre feeling and how much time you have: If you tell me what kind of stress it is (work, parenting, financial, emotional, physical, etc.), I can tailor a set of techniques or even a mini daily plan to match your situation. Would you like me to do that? Ive got you, Ron thats totally normal, especially with everything youve got going on lately. Here are a few ways to decompress depending on what kind of stress youre feeling: Would you like me to tailor a short 5-minute routine you can do right now (either physical, mental, or creative your choice)? Weve also improved instruction following, so the model more reliably answers the question you actually asked. Its trending for summer 2025 destinations. Youll find a mix of culture, nature and modern city life. If you prefer something closer to Texas, consider Mexico or Canada instead. Want suggestions for specific cities in Japan (or elsewhere)? For the first time, GPT5.1 Instant can use adaptive reasoning to decide when to think before responding to more challenging questions, resulting in more thorough and accurate answers, while still responding quickly. This is reflected in significant improvements on math and coding evaluations like AIME 2025 and Codeforces. Were also upgrading GPT5 Thinking to make it more efficient and easier to understand in everyday use. It now adapts its thinking time more precisely to the questionspending more time on complex problems while responding more quickly to simpler ones. In practice, that means more thorough answers for difficult requests and less waiting for simpler ones. GPT5.1 Thinking varies its thinking time more dynamically than GPT5 Thinking. On a representative distribution of ChatGPT tasks, GPT5.1 Thinking is roughly twice as fast on the fastest tasks and twice as slow on the slowest tasks. Thinking time was set to Standard for both models. GPT5.1 Thinkings responses are also clearer, with less jargon and fewer undefined terms. This makes our most capable model more approachable and easily understandable, especially for complex tasks at work and explaining technical concepts. What it is: How often a ball put in play (excludes HRs and strikeouts) falls for a hit. BABIPHHRABKHRSF \\text{BABIP} \\frac{H - HR}{AB - K - HR SF} BABIPABKHRSFHHR What it is: The gold-standard, park- and era-adjusted measure of total offensive value per plate appearance. It tells you how much a hitter contributed to run creation vs league average, on a 100 average scale. Why its great: It compares hitters fairly across parks (Coors vs. Safeco) and seasons (offense-heavy vs dead-ball-ish years). It also captures more than batting averagewalks and extra-base hits count properly. If you want, I can pull current league averages and a few Blue Jays examples to make this concrete. Ill do each one in plain English, then add a bit of context. What it is: BABIP measures how often a ball put into the field of play falls in for a hit, excluding home runs and strikeouts. BABIP (Hits Home Runs) (At-Bats Strikeouts Home Runs Sacrifice Flies) What it is: wRC is a catch-all hitting stat that tells you how good a hitter is at creating runs compared to league average, adjusted for ballpark and era. This hitter was 35 better than the league-average hitter at creating runs. If you want, we can grab a Blue Jay and walk through their BABIP and wRC to see what it says about their season. GPT5.1 Thinkings default tone is also warmer and more empathetic. Ugh I spilled coffee all over myself before my meeting do you think everyone thought I was an idiot :( Oof, thats such a gut-punch feeling. Im really sorry that happened. Short answer: no, most people probably didnt think that. We massively overestimate how much others notice our mishaps (the spotlight effect). Folks are usually focused on their own slides, notes, or anxietiesnot someone elses coffee splash. Youre not an idiotyou were a human who had a spill and kept going. Thats competent, not clumsy. Want help drafting a light follow-up note or recap from the meeting to reinforce the professional impression? Hey no, they didnt. Youre rattled, so your brain is doing that thing where it catastrophizes a tiny mishap into a character flaw. But honestly? People barely register this stuff. Everyones sprinting between calls, half-distracted, juggling their own chaos. A coffee spill reads as busy human, not idiot. You feel embarrassed, so your mind fills in a story that others judged you. In truth, most people wont even remember it happened. Thats competence. Most folks would crumble a bit. You handled it. Small imperfections make people more relatable. A hyper-polished person feels artificial. A quick coffee mishap? Humanizing. And honestly they probably respected that you powered through. Youre not an idiot. Youre a person who had a chaotic moment, wiped it up, and still showed up. Thats the opposite of foolish thats resilience. This release is a step forward in both capability and usability across the models. GPT5.1 Auto will continue to route each query to the model best suited for it, so in most cases, you wont need to choose a model at all. What you will notice is that answers across GPT5.1 feel both smarter and more natural in tone. GPT5.1 Instant and Thinking begin rolling out today, starting with paid (Pro, Plus, Go, Business) users and then to free and logged-out users. Enterprise and Edu plans get a seven-day early-access toggle (off by default). After that window, GPT5.1 will become the sole default model. If you check ChatGPT today, you may not see GPT5.1 available immediately. We plan to roll it out gradually over the next few days to help keep performance stable for everyone. We will also update GPT5 Pro to GPT5.1 Pro soon. Were bringing both GPT5.1 Instant and GPT5.1 Thinking to the API later this week. GPT5.1 Instant will be added as gpt-5.1-chat-latest, and GPT5.1 Thinking will be released as GPT5.1 in the API, both with adaptive reasoning. GPT5 (Instant and Thinking) will remain available in ChatGPT under the legacy models dropdown for paid subscribers for three months, so people have time to compare and adapt at their own pace. The GPT5 sunset period does not affect the availability of other legacy models. Going forward, when we introduce new ChatGPT models, our approach is to give people ample space to evaluate whats changed and share feedback, allowing us to continue innovating our frontier models while transitioning smoothly. Sunset periods will be communicated clearly and with plenty of advance notice. GPT5.1 is more capable and useful, and we encourage you to try it and see the difference. Our system card addendum includes more information on our safety approach for GPT5.1. And a note on naming: this update is called GPT5.1 to reflect meaningful improvements, while remaining within the GPT5 generation. Future iterative upgrades to GPT5 will follow the same pattern. Alongside these model improvements, were making it easier to customize ChatGPTs tone and style. People have strong and varied preferences in how ChatGPT should respond, and tailoring its tone to what sounds right for you should feel effortless. Earlier this year, we added preset options to tailor the tone of how ChatGPT responds. Today, were refining those options to better reflect the most common ways people use ChatGPT. Default, Friendly (formerly Listener), and Efficient (formerly Robot) remain (with updates), and were adding Professional, Candid, and Quirky. These options are designed to align with what weve learned about how people naturally steer the model, making it quick and intuitive to choose a personality that feels uniquely right. These personality settings apply across all models. The original Cynical (formerly Cynic) and Nerdy (formerly Nerd) options we introduced earlier this year will remain available unchanged under the same dropdown in personalization settings. Beyond these presets, for users who want more granular control over how ChatGPT responds, were also experimenting with the ability to tune ChatGPTs characteristics directly from personalization settingsincluding how concise, warm, or scannable its responses are, and how frequently it uses emojis. ChatGPT can also proactively offer to update these preferences during conversations when it notices you asking for a certain tone or style, without requiring you to navigate into settings. You can adjust or remove any of these preferences at any time. The updated styles and tone options are rolling out today, and the ability to finetune specific characteristics is starting to roll out gradually later this week as an experiment, starting with a limited number of users. Both will continue to improve over time. Additionally, the updated GPT5.1 models are also better at adhering to custom instructions, giving you even more precise control over tone and behavior. Updates you make in personalization settings now take effect across all chats right away, including ongoing conversations, so your experience stays consistent. Before, changes to base style and tone or custom instructions only applied to conversations started afterward. Todays GPT5.1 updates and new customization options are a step toward a ChatGPT that feels like it fits yousmarter, more enjoyable to talk to, and more adaptable to your preferences. Going forward, well continue improving along these dimensionstheres much more to come."
}